In [5]:
import pandas as pd

In [6]:
file = "Resources\Heroesofpymoli.csv"

In [7]:
orignal_df = pd.read_csv(file)
orignal_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [8]:
df = orignal_df.set_index('Purchase ID')
df.head()

,SN,Age,Gender,Item ID,Item Name,Price
Purchase ID,,,,,,
0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,Ithergue48,24,Male,92,Final Critic,4.88
3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,Iskosia90,23,Male,131,Fury,1.44

In [9]:
#list
df.SN

Purchase ID
0            Lisim78
1        Lisovynya38
2         Ithergue48
3      Chamassasya86
4          Iskosia90
           ...
775       Aethedru70
776           Iral74
777       Yathecal72
778          Sisur91
779        Ennrian78
Name: SN, Length: 780, dtype: object

In [10]:
# find total players
Total_Players = len(df['SN'].unique())
Total_Players

576

In [11]:
#unique items
Total_Unique_items = len(df['Item ID'].unique())
Total_Unique_items

179

In [12]:
#average price
Average_Price = df['Price'].mean()
Average_Price

3.050987179487176

In [13]:
#Number of Purchases
Number_of_Purchases = df["SN"].count()
Number_of_Purchases

780

In [14]:
#Total Revenue
Total_Revenue = df['Price'].sum()
Total_Revenue

2379.77

In [15]:
#Summary Table
summary={
    'Total Unique Items' : [Total_Unique_items],
    'Average Price' : [Average_Price],
    'Number of Purchases' : [Number_of_Purchases],
    'Total Revenue' : [Total_Revenue]
}
summary_df=pd.DataFrame(summary)
summary_df

   Total Unique Items  Average Price  Number of Purchases  Total Revenue
0                 179       3.050987                  780        2379.77

In [21]:
df.Gender

Purchase ID
0        Male
1        Male
2        Male
3        Male
4        Male
        ...
775    Female
776      Male
777      Male
778      Male
779      Male
Name: Gender, Length: 780, dtype: object

In [24]:
Gender = df['Gender'].count()
Gender

780

In [25]:
#male or female
Female = df['Gender'].value_counts()['Female']
Female

113

In [45]:
Female_Percentage = str(Female/Gender*100) + '%'
Female_Percentage

'14.487179487179489%'

In [18]:
Male = df['Gender'].value_counts()['Male']
Male

652

In [39]:
Male_Percentage = str(Male/Gender*100) + '%'
Male_Percentage

'83.58974358974359%'

In [29]:
Other/Non-Disclosed = df['Gender'].value_counts()['Other" / "Non-Disclosed']
Other/Non-Disclosed

SyntaxError: can't assign to operator (<ipython-input-29-706f3cf53d87>, line 1)